# TCP и UDP
# TCP - безопасный и медленный (он ждёт сообщение о соединении, если пакеты не пришли, он их досылает)
# UDP - небезопасный и быстрый (он не ждёт сообщение о соединении, если пакеты не пришли, он их не досылает)

# socket == ip:port (only 1 program)

# ip
# cmd -> ipconfig (192.168.0.128) | sh -> ip a

# port
# 192.168.0.128:22
# 192.168.0.128:21
# 192.168.0.128:80 (TCP HTTP)
# 192.168.0.128:443 (TCP HTTPS)
# localhost:8000 - django
# 127.0.0.1:8000 - django
# 127.0.0.1:8001 - django
# 127.0.0.1:8080 - django

# skype, zoom, diskord, telegramm....
