# Создать почту
# Создать аккаунт на pythonanywhere
# Создание шаблонного веб-приложения - для того чтобы "украсть" всю сложную конфигурацию
# Включить https и перезагрузить приложение
# Проверит работоспособность сайта https://andrienko19972.pythonanywhere.com/
# Скопировать шаблон и "накинуть" на него свои изменения
# Собрать статику (STATICFILES_DIRS)
# Загрузить архив с всем проектом в файлы
# разархивировать
# - ls
# - unzip 1_landing.zip
# - изменить "пути" в настройках pythonanywhere + WSGI configuration file
# перезагрузить приложение и проверить работоспособность сайта https://andrienko19972.pythonanywhere.com/
